src/tests/load/search-load-result.txt
Test run id: tqrme_hp3g9kfyjz7pg7mkfgkjbqfc7yeyw_xd5f
Phase started: Warm up phase (index: 0, duration: 60s) 10:49:48(+0100)

--------------------------------------
Metrics for period to: 10:49:50(+0100) (width: 1.642s)
--------------------------------------

http.request_rate: ............................................................. 316/sec
http.requests: ................................................................. 412
vusers.created: ................................................................ 415
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 415


--------------------------------------
Metrics for period to: 10:50:00(+0100) (width: 9.995s)
--------------------------------------

errors.ECONNRESET: ............................................................. 2625
errors.ETIMEDOUT: .............................................................. 407
http.request_rate: ............................................................. 419/sec
http.requests: ................................................................. 4173
vusers.created: ................................................................ 4170
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 4170
vusers.failed: ................................................................. 3032


--------------------------------------
Metrics for period to: 10:50:10(+0100) (width: 9.995s)
--------------------------------------

errors.ECONNRESET: ............................................................. 6160
errors.ETIMEDOUT: .............................................................. 1553
http.request_rate: ............................................................. 621/sec
http.requests: ................................................................. 6169
vusers.created: ................................................................ 6169
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 6169
vusers.failed: ................................................................. 7713


--------------------------------------
Metrics for period to: 10:50:20(+0100) (width: 9.998s)
--------------------------------------

errors.ECONNRESET: ............................................................. 7785
http.request_rate: ............................................................. 821/sec
http.requests: ................................................................. 8187
vusers.created: ................................................................ 8187
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 8187
vusers.failed: ................................................................. 7785


--------------------------------------
Metrics for period to: 10:50:30(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 8644
errors.ETIMEDOUT: .............................................................. 401
http.request_rate: ............................................................. 1023/sec
http.requests: ................................................................. 10193
vusers.created: ................................................................ 10194
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 10194
vusers.failed: ................................................................. 9045


--------------------------------------
Metrics for period to: 10:50:40(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 12170
errors.ETIMEDOUT: .............................................................. 1559
http.request_rate: ............................................................. 1221/sec
http.requests: ................................................................. 12175
vusers.created: ................................................................ 12177
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 12177
vusers.failed: ................................................................. 13729


Phase completed: Warm up phase (index: 0, duration: 60s) 10:50:48(+0100)

Phase started: Sustained peak load (index: 1, duration: 120s) 10:50:48(+0100)

--------------------------------------
Metrics for period to: 10:50:50(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 13651
http.request_rate: ............................................................. 1418/sec
http.requests: ................................................................. 14146
vusers.created: ................................................................ 14144
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 14144
vusers.failed: ................................................................. 13651


--------------------------------------
Metrics for period to: 10:51:00(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNREFUSED: ........................................................... 152
errors.ECONNRESET: ............................................................. 7949
errors.ETIMEDOUT: .............................................................. 381
http.codes.429: ................................................................ 1458
http.downloaded_bytes: ......................................................... 59778
http.request_rate: ............................................................. 1441/sec
http.requests: ................................................................. 14321
http.response_time:
  min: ......................................................................... 15
  max: ......................................................................... 1604
  mean: ........................................................................ 580.5
  median: ...................................................................... 528.6
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1587.9
http.response_time.4xx:
  min: ......................................................................... 15
  max: ......................................................................... 1604
  mean: ........................................................................ 580.5
  median: ...................................................................... 528.6
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 1458
vusers.completed: .............................................................. 1458
vusers.created: ................................................................ 14320
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 14320
vusers.failed: ................................................................. 8482
vusers.session_length:
  min: ......................................................................... 29.9
  max: ......................................................................... 2859.1
  mean: ........................................................................ 1451.3
  median: ...................................................................... 1300.1
  p95: ......................................................................... 2566.3
  p99: ......................................................................... 2780


--------------------------------------
Metrics for period to: 10:51:10(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNREFUSED: ........................................................... 44
errors.ECONNRESET: ............................................................. 7426
errors.ETIMEDOUT: .............................................................. 1622
http.codes.429: ................................................................ 1170
http.downloaded_bytes: ......................................................... 47970
http.request_rate: ............................................................. 1495/sec
http.requests: ................................................................. 14726
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 1334
  mean: ........................................................................ 560.7
  median: ...................................................................... 528.6
  p95: ......................................................................... 1200.1
  p99: ......................................................................... 1300.1
http.response_time.4xx:
  min: ......................................................................... 12
  max: ......................................................................... 1334
  mean: ........................................................................ 560.7
  median: ...................................................................... 528.6
  p95: ......................................................................... 1200.1
  p99: ......................................................................... 1300.1
http.responses: ................................................................ 1170
vusers.completed: .............................................................. 1170
vusers.created: ................................................................ 14729
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 14729
vusers.failed: ................................................................. 9092
vusers.session_length:
  min: ......................................................................... 2574.3
  max: ......................................................................... 6287.6
  mean: ........................................................................ 4625.3
  median: ...................................................................... 4965.3
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 6187.2


--------------------------------------
Metrics for period to: 10:51:20(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 2983
errors.ETIMEDOUT: .............................................................. 5974
http.codes.429: ................................................................ 352
http.downloaded_bytes: ......................................................... 14432
http.request_rate: ............................................................. 1469/sec
http.requests: ................................................................. 14590
http.response_time:
  min: ......................................................................... 617
  max: ......................................................................... 2683
  mean: ........................................................................ 1686.5
  median: ...................................................................... 1556.5
  p95: ......................................................................... 2671
  p99: ......................................................................... 2671
http.response_time.4xx:
  min: ......................................................................... 617
  max: ......................................................................... 2683
  mean: ........................................................................ 1686.5
  median: ...................................................................... 1556.5
  p95: ......................................................................... 2671
  p99: ......................................................................... 2671
http.responses: ................................................................ 352
vusers.completed: .............................................................. 352
vusers.created: ................................................................ 14587
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 14587
vusers.failed: ................................................................. 8957
vusers.session_length:
  min: ......................................................................... 8430
  max: ......................................................................... 10339.3
  mean: ........................................................................ 9395
  median: ...................................................................... 9416.8
  p95: ......................................................................... 10201.2
  p99: ......................................................................... 10201.2


--------------------------------------
Metrics for period to: 10:51:30(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 604
errors.ETIMEDOUT: .............................................................. 13739
http.request_rate: ............................................................. 1613/sec
http.requests: ................................................................. 15944
vusers.created: ................................................................ 15947
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 15947
vusers.failed: ................................................................. 14343


--------------------------------------
Metrics for period to: 10:51:40(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 470
errors.ETIMEDOUT: .............................................................. 15707
http.request_rate: ............................................................. 1554/sec
http.requests: ................................................................. 15418
vusers.created: ................................................................ 15416
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 15416
vusers.failed: ................................................................. 16177


--------------------------------------
Metrics for period to: 10:51:50(+0100) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 51
errors.ETIMEDOUT: .............................................................. 15048
http.request_rate: ............................................................. 1407/sec
http.requests: ................................................................. 14018
vusers.created: ................................................................ 14019
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 14019
vusers.failed: ................................................................. 15099


--------------------------------------
Metrics for period to: 10:52:00(+0100) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 13989
http.request_rate: ............................................................. 1364/sec
http.requests: ................................................................. 13616
vusers.created: ................................................................ 13616
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 13616
vusers.failed: ................................................................. 13989


--------------------------------------
Metrics for period to: 10:52:10(+0100) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 13662
http.request_rate: ............................................................. 1786/sec
http.requests: ................................................................. 16444
vusers.created: ................................................................ 16444
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 16444
vusers.failed: ................................................................. 13662


--------------------------------------
Metrics for period to: 10:52:20(+0100) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 12983
http.request_rate: ............................................................. 1230/sec
http.requests: ................................................................. 12276
vusers.created: ................................................................ 12276
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 12276
vusers.failed: ................................................................. 12983


Phase completed: Sustained peak load (index: 1, duration: 120s) 10:52:48(+0100)

Phase started: Cool down phase (index: 2, duration: 60s) 10:52:48(+0100)

--------------------------------------
Metrics for period to: 10:52:30(+0100) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 13841
http.request_rate: ............................................................. 1059/sec
http.requests: ................................................................. 10572
vusers.created: ................................................................ 10572
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 10572
vusers.failed: ................................................................. 13841


--------------------------------------
Metrics for period to: 10:52:40(+0100) (width: 9.999s)
--------------------------------------

errors.EADDRINUSE: ............................................................. 2
errors.ETIMEDOUT: .............................................................. 13615
http.request_rate: ............................................................. 1788/sec
http.requests: ................................................................. 17117
vusers.created: ................................................................ 17117
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 17117
vusers.failed: ................................................................. 13617


--------------------------------------
Metrics for period to: 10:52:50(+0100) (width: 9.999s)
--------------------------------------

errors.EADDRINUSE: ............................................................. 5
errors.ETIMEDOUT: .............................................................. 17859
http.request_rate: ............................................................. 1580/sec
http.requests: ................................................................. 14584
vusers.created: ................................................................ 14584
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 14584
vusers.failed: ................................................................. 17864


--------------------------------------
Metrics for period to: 10:53:00(+0100) (width: 9.946s)
--------------------------------------

errors.EADDRINUSE: ............................................................. 1
errors.ETIMEDOUT: .............................................................. 15024
http.request_rate: ............................................................. 1419/sec
http.requests: ................................................................. 13925
vusers.created: ................................................................ 13924
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 13924
vusers.failed: ................................................................. 15025


--------------------------------------
Metrics for period to: 10:53:10(+0100) (width: 9.978s)
--------------------------------------

errors.EADDRINUSE: ............................................................. 58
errors.ETIMEDOUT: .............................................................. 13949
http.request_rate: ............................................................. 1170/sec
http.requests: ................................................................. 11530
vusers.created: ................................................................ 11530
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 11530
vusers.failed: ................................................................. 14007


--------------------------------------
Metrics for period to: 10:53:20(+0100) (width: 9.999s)
--------------------------------------

errors.EADDRINUSE: ............................................................. 74
errors.ECONNRESET: ............................................................. 603
errors.ETIMEDOUT: .............................................................. 10820
http.request_rate: ............................................................. 1020/sec
http.requests: ................................................................. 10153
vusers.created: ................................................................ 10154
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 10154
vusers.failed: ................................................................. 11497


--------------------------------------
Metrics for period to: 10:53:30(+0100) (width: 9.999s)
--------------------------------------

errors.EADDRINUSE: ............................................................. 4
errors.ECONNRESET: ............................................................. 779
errors.ETIMEDOUT: .............................................................. 9360
http.request_rate: ............................................................. 827/sec
http.requests: ................................................................. 8201
vusers.created: ................................................................ 8201
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 8201
vusers.failed: ................................................................. 10143


--------------------------------------
Metrics for period to: 10:53:40(+0100) (width: 9.992s)
--------------------------------------

errors.EADDRINUSE: ............................................................. 2
errors.ECONNRESET: ............................................................. 783
errors.ETIMEDOUT: .............................................................. 7461
http.request_rate: ............................................................. 634/sec
http.requests: ................................................................. 6240
vusers.created: ................................................................ 6240
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 6240
vusers.failed: ................................................................. 8246


Phase completed: Cool down phase (index: 2, duration: 60s) 10:53:50(+0100)

--------------------------------------
Metrics for period to: 10:53:50(+0100) (width: 9.99s)
--------------------------------------

errors.ECONNRESET: ............................................................. 4383
errors.ETIMEDOUT: .............................................................. 1926
http.request_rate: ............................................................. 432/sec
http.requests: ................................................................. 4252
vusers.created: ................................................................ 4252
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 4252
vusers.failed: ................................................................. 6309


--------------------------------------
Metrics for period to: 10:54:00(+0100) (width: 9.945s)
--------------------------------------

errors.ECONNRESET: ............................................................. 4382
errors.ETIMEDOUT: .............................................................. 252
http.codes.429: ................................................................ 29
http.codes.500: ................................................................ 3
http.downloaded_bytes: ......................................................... 1636
http.request_rate: ............................................................. 229/sec
http.requests: ................................................................. 625
http.response_time:
  min: ......................................................................... 34
  max: ......................................................................... 1045
  mean: ........................................................................ 138.3
  median: ...................................................................... 46.1
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7
http.response_time.4xx:
  min: ......................................................................... 34
  max: ......................................................................... 53
  mean: ........................................................................ 45.6
  median: ...................................................................... 46.1
  p95: ......................................................................... 51.9
  p99: ......................................................................... 53
http.response_time.5xx:
  min: ......................................................................... 1028
  max: ......................................................................... 1045
  mean: ........................................................................ 1034
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 32
vusers.completed: .............................................................. 32
vusers.created: ................................................................ 624
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 624
vusers.failed: ................................................................. 4634
vusers.session_length:
  min: ......................................................................... 1711.7
  max: ......................................................................... 8631.6
  mean: ........................................................................ 2701.7
  median: ...................................................................... 2231
  p95: ......................................................................... 7117
  p99: ......................................................................... 7117


--------------------------------------
Metrics for period to: 10:54:10(+0100) (width: 8.747s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 135
http.codes.500: ................................................................ 8
http.downloaded_bytes: ......................................................... 1192
http.response_time:
  min: ......................................................................... 1703
  max: ......................................................................... 4801
  mean: ........................................................................ 3250
  median: ...................................................................... 2725
  p95: ......................................................................... 4770.6
  p99: ......................................................................... 4770.6
http.response_time.5xx:
  min: ......................................................................... 1703
  max: ......................................................................... 4801
  mean: ........................................................................ 3250
  median: ...................................................................... 2725
  p95: ......................................................................... 4770.6
  p99: ......................................................................... 4770.6
http.responses: ................................................................ 8
vusers.completed: .............................................................. 8
vusers.failed: ................................................................. 135
vusers.session_length:
  min: ......................................................................... 6099.6
  max: ......................................................................... 9211.5
  mean: ........................................................................ 7679.3
  median: ...................................................................... 7260.8
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9230.4


All VUs finished. Total time: 4 minutes, 22 seconds

--------------------------------
Summary report @ 10:54:10(+0100)
--------------------------------

errors.EADDRINUSE: ............................................................. 146
errors.ECONNREFUSED: ........................................................... 196
errors.ECONNRESET: ............................................................. 81448
errors.ETIMEDOUT: .............................................................. 201267
http.codes.429: ................................................................ 3009
http.codes.500: ................................................................ 11
http.downloaded_bytes: ......................................................... 125008
http.request_rate: ............................................................. 1095/sec
http.requests: ................................................................. 284007
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 4801
  mean: ........................................................................ 704.1
  median: ...................................................................... 608
  p95: ......................................................................... 1686.1
  p99: ......................................................................... 2671
http.response_time.4xx:
  min: ......................................................................... 12
  max: ......................................................................... 2683
  mean: ........................................................................ 697
  median: ...................................................................... 608
  p95: ......................................................................... 1686.1
  p99: ......................................................................... 2671
http.response_time.5xx:
  min: ......................................................................... 1028
  max: ......................................................................... 4801
  mean: ........................................................................ 2645.6
  median: ...................................................................... 2725
  p95: ......................................................................... 4770.6
  p99: ......................................................................... 4770.6
http.responses: ................................................................ 3020
vusers.completed: .............................................................. 3020
vusers.created: ................................................................ 284008
vusers.created_by_name.Search Restaurants by Zip Code: ......................... 284008
vusers.failed: ................................................................. 283057
vusers.session_length:
  min: ......................................................................... 29.9
  max: ......................................................................... 10339.3
  mean: ........................................................................ 3636.6
  median: ...................................................................... 2780
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 10201.2